# TMS_Core_AN04

## Lesson 1
Запрещено использование условных операторов ветвления (`if-else` конструкции)

1) В переменную записываем число. Надо вывести на экран сколько в этом
числе цифр и положительное оно или отрицательное. Например, "это
однозначное положительное число". Добавить решение для дробных чисел.
2) Треугольник существует только тогда, когда сумма любых двух его сторон
больше третьей. Определить существует ли такой треугольник. Дано: a, b, c –
стороны предполагаемого треугольника. Требуется сравнить длину каждого
отрезка-стороны с суммой двух других. Если хотя бы в одном случае отрезок
окажется больше суммы двух других, то треугольника с такими сторонами не
существует. Подсказка: используйте тип `boolean` и логические операции с ним: `||` - логическое ИЛИ, `&&` - логическое И
 * `5 > 0 || 5 < 0` - результат `true`
 * `5 > 0 && 5 < 0` - результат `false`
 * `1 > 1 || 2 > 2 || 3 >= 3` - результат `true`
3) Даны 2 числа. Вывести большее из них. Подсказка: используйте `Math.abs(..)` для нахождения модуля числа
4) (*) Даны 3 целых числа. Найти количество положительных чисел в исходном
наборе. Подсказка: используйте `Math.abs(..)` для нахождения модуля числа

## Lesson 2

1.1) Написать программу, которая читает введеное с консоли число. Число должно быть от 1 до 12. 
Напечатать на консоль название месяца, которое соответствует введеному числу (например 1 - Январь)
Если число неправильное (не от 1 до 12), напечатать на консоль сообщение, информирующее об ошибке (например "Неправильное число, должно быть от 1 до 12)
Для считывание числа с консоли используйте
```
Scanner in = new Scanner(System.in);
System.out.print("Введите число: ");
int num = in.nextInt();
//
// работа с числом
//
in.close()
```
2.1) Дано 2 числа, день и месяц рождения. Написать программу, которая определяет знак зодиака человека.

3.1) Напишите программу, определяющую сумму всех нечетных чисел от 1
до 99

3.2) Вычислить: 1+2+4+8+...+256
3.3) Начав тренировки, спортсмен в первый день пробежал 10 км. Каждый
день он увеличивал дневную норму на 10% нормы предыдущего дня. Какой
суммарный путь пробежит спортсмен за 7 дней?

4.1) Дано положительное число x (например 1098). Написать программу, которая печатает на консоль все цифры данного числа (используя цикл while)

5.1) Написать программу, которая печатает на консоль прямоугольник из символа "@" длины NxM (задается вручную, т.е. int n = 10; int m = 5, например)
```
@@@@@@@@@@
@@@@@@@@@@
@@@@@@@@@@
@@@@@@@@@@
@@@@@@@@@@
```
5.2) Дано число x, найти все простые числа от 1 до x (число считается простым, если делится только на себя и на 1) 
